PROCLITICS = [
    "ὁ", "ἡ", "οἱ", "αἱ",
    "ἐν", "εἰς", "ἐξ", "ἐκ",
    "εἰ", "ὡς",
    "οὐ", "οὐκ", "οὐχ",
]

ENCLITICS = [
    # personal pronouns
    "μου", "μοι", "με",
    "σου", "σοι", "σε",

    # indefinite pronouns
    "τὶς", "τὶ", "τινός", "τινί", "τινά", "τινές", "τινάς", "τινῶν", "τισίν",
    "τισί",

    # indefinite adverbs
    "πού", "ποτέ", "πώ", "πώς",

    # dissyllabic forms of εἰμί
    "εἰμί", "εἰσίν", "εἰσί", "ἐσμέν", "ἐστέ", "ἐστίν", "ἐστί",

    # dissyllabic forms of φημί
    "φησίν", "φημί", "φασίν",

    # certain particles
    "γέ", "τέ",
]


ELISION = {
    "ἀλλ’": "ἀλλά",
    "ἀνθ’": "ἀντί",
    "ἀπ’": "ἀπό",
    "ἀφ’": "ἀπό",
    "δ’": "δέ",
    "δι’": "διά",
    "ἐπ’": "ἐπί",
    "ἐφ’": "ἐπί",
    "κατ’": "κατά",
    "καθ’": "κατά",
    "μηδ’": "μηδέ",
    "μετ’": "μετά",
    "μεθ’": "μετά",
    "οὐδ’": "οὐδέ",
    "παρ’": "παρά",
    "τοῦτ’": "τοῦτο",
    "ὑπ’": "ὑπό",
    "ὑφ’": "ὑπό",
}


MOVABLE = {
    "ἐξ": "ἐκ",

    "οὐκ": "οὐ",
    "οὐχ": "οὐ",
}


PROPER_NOUNS = {
    "Ἀβραάμ",
    "Αἰγύπτου",
    "Ἀφθαρσία",
    "Βεζελεήλ",
    "Ἡσαΐας",
    "Ἱεροσολυμίταις",
    "Ἰσραηλίταις",
    "Ἰωάννου",
    "Μεσοποταμίας",
    "Μωϋσέα",
    "Πέτρος",
    "Χριστιανῶν",

    # "Ἀπλήρωτον",
    # "Θεῷ",
    # "Κυρίου",
    # "Μακάριοι",
    # "Πνεῦμα",
    # "Πνεύματι",
    # "Πνεύματος",
}
